"""
高德省份
    中国有23个省4个直辖市、2个特别行政区、5个自治区。
    二十三个省：河北省（冀）、山东省（齐）、辽宁省（辽）、黑龙江省（黑）、吉林省（吉）、甘肃省（陇）、青海省（青）、河南省（豫）、江苏省（苏）、湖北省（鄂）、湖南省（湘）、江西省（赣）、浙江省（浙）、广东省（粤）、云南省（滇）、福建省（福）、台湾省（台）、海南省（琼）、山西省（晋）、四川省（川）、陕西省（陕）、贵州省（黔）、安徽省（皖）。
    四个直辖市：重庆市、北京市、上海市、天津市。
    五个自治区：广西壮族自治区、内蒙古自治区、西藏自治区、新疆维吾尔自治区、宁夏回族自治区。
    两个特别行政区：澳门特别行政区、香港特别行政区。
如下32个，不计算特别行政区
"""

provincelist = [{"name":"河北省","code":"130000","next":[]},{"name":"山西省","code":"140000","next":[]},{"name":"辽宁省","code":"210000","next":[]},{"name":"吉林省","code":"220000","next":[]},{"name":"黑龙江省","code":"230000","next":[]},{"name":"江苏省","code":"320000","next":[]},{"name":"浙江省","code":"330000","next":[]},{"name":"安徽省","code":"340000","next":[]},{"name":"福建省","code":"350000","next":[]},{"name":"江西省","code":"360000","next":[]},{"name":"山东省","code":"370000","next":[]},{"name":"河南省","code":"410000","next":[]},{"name":"湖北省","code":"420000","next":[]},{"name":"湖南省","code":"430000","next":[]},{"name":"广东省","code":"440000","next":[]},{"name":"海南省","code":"460000","next":[]},{"name":"四川省","code":"510000","next":[]},{"name":"贵州省","code":"520000","next":[]},{"name":"陕西省","code":"610000","next":[]},{"name":"云南省","code":"530000","next":[]},{"name":"甘肃省","code":"620000","next":[]},{"name":"青海省","code":"630000","next":[]},{"name":"台湾省","code":"710000","next":[]},{"name":"重庆市","code":"500000","next":[]},{"name":"北京市","code":"110000","next":[]},{"name":"上海市","code":"310000","next":[]},{"name":"天津市","code":"120000","next":[]},{"name":"广西壮族自治区","code":"450000","next":[]},{"name":"内蒙古自治区","code":"150000","next":[]},{"name":"西藏自治区","code":"540000","next":[]},{"name":"新疆维吾尔自治区","code":"650000","next":[]},{"name":"宁夏回族自治区","code":"640000","next":[]}]


def get_province():
    return provincelist
